mwales-ai/qemu_plus_plus/hw/misc/stm32l4x5_rcc.cpp
static void stm32l4x5_rcc_init(Object *obj)
{
    Stm32l4x5RccState *s = STM32L4X5_RCC(obj);
    size_t i;

    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    memory_region_init_io(&s->mmio, obj, &stm32l4x5_rcc_ops, s,
                          TYPE_STM32L4X5_RCC, 0x400);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);

    qdev_init_clocks(DEVICE(s), stm32l4x5_rcc_clocks);

    for (i = 0; i < RCC_NUM_PLL; i++) {
        object_initialize_child(obj, PLL_INIT_INFO[i].name,
                                &s->plls[i], TYPE_RCC_PLL);
        set_pll_init_info(&s->plls[i], static_cast<RccPll>(i));
    }

    for (i = 0; i < RCC_NUM_CLOCK_MUX; i++) {
        char *alias;

        object_initialize_child(obj, CLOCK_MUX_INIT_INFO[i].name,
                                &s->clock_muxes[i],
                                TYPE_RCC_CLOCK_MUX);
        set_clock_mux_init_info(&s->clock_muxes[i], static_cast<RccClockMux>(i));

        if (!CLOCK_MUX_INIT_INFO[i].hidden) {
            /* Expose muxes output as RCC outputs */
            alias = g_strdup_printf("%s-out", CLOCK_MUX_INIT_INFO[i].name);
            qdev_alias_clock(DEVICE(&s->clock_muxes[i]), "out", DEVICE(obj), alias);
            g_free(alias);
        }
    }

    s->gnd = clock_new(obj, "gnd");
}

static void connect_mux_sources(Stm32l4x5RccState *s,
                                RccClockMuxState *mux,
                                const RccClockMuxSource *clk_mapping)
{
    size_t i;

    Clock * const CLK_SRC_MAPPING[] = {
        [RCC_CLOCK_MUX_SRC_GND] = s->gnd,
        [RCC_CLOCK_MUX_SRC_HSI] = s->hsi16_rc,
        [RCC_CLOCK_MUX_SRC_HSE] = s->hse,
        [RCC_CLOCK_MUX_SRC_MSI] = s->msi_rc,
        [RCC_CLOCK_MUX_SRC_LSI] = s->lsi_rc,
        [RCC_CLOCK_MUX_SRC_LSE] = s->lse_crystal,
        [RCC_CLOCK_MUX_SRC_SAI1_EXTCLK] = s->sai1_extclk,
        [RCC_CLOCK_MUX_SRC_SAI2_EXTCLK] = s->sai2_extclk,
        [RCC_CLOCK_MUX_SRC_PLL] =
            s->plls[RCC_PLL_PLL].channels[RCC_PLL_CHANNEL_PLLCLK],
        [RCC_CLOCK_MUX_SRC_PLLSAI1] =
            s->plls[RCC_PLL_PLLSAI1].channels[RCC_PLLSAI1_CHANNEL_PLLSAI1CLK],
        [RCC_CLOCK_MUX_SRC_PLLSAI2] =
            s->plls[RCC_PLL_PLLSAI2].channels[RCC_PLLSAI2_CHANNEL_PLLSAI2CLK],
        [RCC_CLOCK_MUX_SRC_PLLSAI3] =
            s->plls[RCC_PLL_PLL].channels[RCC_PLL_CHANNEL_PLLSAI3CLK],
        [RCC_CLOCK_MUX_SRC_PLL48M1] =
            s->plls[RCC_PLL_PLL].channels[RCC_PLL_CHANNEL_PLL48M1CLK],
        [RCC_CLOCK_MUX_SRC_PLL48M2] =
            s->plls[RCC_PLL_PLLSAI1].channels[RCC_PLLSAI1_CHANNEL_PLL48M2CLK],
        [RCC_CLOCK_MUX_SRC_PLLADC1] =
            s->plls[RCC_PLL_PLLSAI1].channels[RCC_PLLSAI1_CHANNEL_PLLADC1CLK],
        [RCC_CLOCK_MUX_SRC_PLLADC2] =
            s->plls[RCC_PLL_PLLSAI2] .channels[RCC_PLLSAI2_CHANNEL_PLLADC2CLK],
        [RCC_CLOCK_MUX_SRC_SYSCLK] = s->clock_muxes[RCC_CLOCK_MUX_SYSCLK].out,
        [RCC_CLOCK_MUX_SRC_HCLK] = s->clock_muxes[RCC_CLOCK_MUX_HCLK].out,
        [RCC_CLOCK_MUX_SRC_PCLK1] = s->clock_muxes[RCC_CLOCK_MUX_PCLK1].out,
        [RCC_CLOCK_MUX_SRC_PCLK2] = s->clock_muxes[RCC_CLOCK_MUX_PCLK2].out,
        [RCC_CLOCK_MUX_SRC_HSE_OVER_32] = s->clock_muxes[RCC_CLOCK_MUX_HSE_OVER_32].out,
        [RCC_CLOCK_MUX_SRC_LCD_AND_RTC_COMMON] =
            s->clock_muxes[RCC_CLOCK_MUX_LCD_AND_RTC_COMMON].out,
    };

    assert(ARRAY_SIZE(CLK_SRC_MAPPING) == RCC_CLOCK_MUX_SRC_NUMBER);

    for (i = 0; i < RCC_NUM_CLOCK_MUX_SRC; i++) {
        RccClockMuxSource mapping = clk_mapping[i];
        clock_set_source(mux->srcs[i], CLK_SRC_MAPPING[mapping]);
    }
}


static const VMStateField vmstate_stm32l4x5_rcc_fields[] = {
    VMSTATE_UINT32(cr, Stm32l4x5RccState),
    VMSTATE_UINT32(icscr, Stm32l4x5RccState),
    VMSTATE_UINT32(cfgr, Stm32l4x5RccState),
    VMSTATE_UINT32(pllcfgr, Stm32l4x5RccState),
    VMSTATE_UINT32(pllsai1cfgr, Stm32l4x5RccState),
    VMSTATE_UINT32(pllsai2cfgr, Stm32l4x5RccState),
    VMSTATE_UINT32(cier, Stm32l4x5RccState),
    VMSTATE_UINT32(cifr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb1rstr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb2rstr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb3rstr, Stm32l4x5RccState),
    VMSTATE_UINT32(apb1rstr1, Stm32l4x5RccState),
    VMSTATE_UINT32(apb1rstr2, Stm32l4x5RccState),
    VMSTATE_UINT32(apb2rstr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb1enr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb2enr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb3enr, Stm32l4x5RccState),
    VMSTATE_UINT32(apb1enr1, Stm32l4x5RccState),
    VMSTATE_UINT32(apb1enr2, Stm32l4x5RccState),
    VMSTATE_UINT32(apb2enr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb1smenr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb2smenr, Stm32l4x5RccState),
    VMSTATE_UINT32(ahb3smenr, Stm32l4x5RccState),
    VMSTATE_UINT32(apb1smenr1, Stm32l4x5RccState),
    VMSTATE_UINT32(apb1smenr2, Stm32l4x5RccState),
    VMSTATE_UINT32(apb2smenr, Stm32l4x5RccState),
    VMSTATE_UINT32(ccipr, Stm32l4x5RccState),
    VMSTATE_UINT32(bdcr, Stm32l4x5RccState),
    VMSTATE_UINT32(csr, Stm32l4x5RccState),
    VMSTATE_CLOCK(hsi16_rc, Stm32l4x5RccState),
    VMSTATE_CLOCK(msi_rc, Stm32l4x5RccState),
    VMSTATE_CLOCK(hse, Stm32l4x5RccState),
    VMSTATE_CLOCK(lsi_rc, Stm32l4x5RccState),
    VMSTATE_CLOCK(lse_crystal, Stm32l4x5RccState),
    VMSTATE_CLOCK(sai1_extclk, Stm32l4x5RccState),
    VMSTATE_CLOCK(sai2_extclk, Stm32l4x5RccState),
    VMSTATE_END_OF_LIST()
};

static const VMStateDescription vmstate_stm32l4x5_rcc = {
    .name = TYPE_STM32L4X5_RCC,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = vmstate_stm32l4x5_rcc_fields,
};


static void stm32l4x5_rcc_realize(DeviceState *dev, Error **errp)
{
    Stm32l4x5RccState *s = STM32L4X5_RCC(dev);
    size_t i;

    if (s->hse_frequency <  4000000ULL ||
        s->hse_frequency > 48000000ULL) {
            error_setg(errp,
                "HSE frequency is outside of the allowed [4-48]Mhz range: %" PRIx64 "",
                s->hse_frequency);
            return;
        }

    for (i = 0; i < RCC_NUM_PLL; i++) {
        RccPllState *pll = &s->plls[i];

        clock_set_source(pll->in, s->clock_muxes[RCC_CLOCK_MUX_PLL_INPUT].out);

