mwales-ai/qemu_plus_plus/hw/misc/stm32l4x5_rcc.cpp
        if (!qdev_realize(DEVICE(pll), NULL, errp)) {
            return;
        }
    }

    for (i = 0; i < RCC_NUM_CLOCK_MUX; i++) {
        RccClockMuxState *clock_mux = &s->clock_muxes[i];

        connect_mux_sources(s, clock_mux, CLOCK_MUX_INIT_INFO[i].src_mapping);

        if (!qdev_realize(DEVICE(clock_mux), NULL, errp)) {
            return;
        }
    }

    /*
     * Start clocks after everything is connected
     * to propagate the frequencies along the tree.
     */
    clock_update_hz(s->msi_rc, MSI_DEFAULT_FRQ);
    clock_update_hz(s->sai1_extclk, s->sai1_extclk_frequency);
    clock_update_hz(s->sai2_extclk, s->sai2_extclk_frequency);
    clock_update(s->gnd, 0);
}

static const Property stm32l4x5_rcc_properties[] = {
    DEFINE_PROP_UINT64("hse_frequency", Stm32l4x5RccState,
        hse_frequency, HSE_DEFAULT_FRQ),
    DEFINE_PROP_UINT64("sai1_extclk_frequency", Stm32l4x5RccState,
        sai1_extclk_frequency, 0),
    DEFINE_PROP_UINT64("sai2_extclk_frequency", Stm32l4x5RccState,
        sai2_extclk_frequency, 0),
};

static void stm32l4x5_rcc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    assert(ARRAY_SIZE(CLOCK_MUX_INIT_INFO) == RCC_NUM_CLOCK_MUX);

    rc->phases.hold = stm32l4x5_rcc_reset_hold;
    device_class_set_props(dc, stm32l4x5_rcc_properties);
    dc->realize = stm32l4x5_rcc_realize;
    dc->vmsd = &vmstate_stm32l4x5_rcc;
}

#include "qom/cpp/object.h"

REGISTER_QEMU_OBJECT_INIT_CLASS_SIZED_NOCS(stm32l4x5_rcc, Stm32l4x5RccState,
                                            TYPE_STM32L4X5_RCC,
                                            TYPE_SYS_BUS_DEVICE,
                                            stm32l4x5_rcc_init,
                                            stm32l4x5_rcc_class_init)

REGISTER_QEMU_OBJECT_INIT_CLASS_SIZED_NOCS(rcc_clock_mux, RccClockMuxState,
                                            TYPE_RCC_CLOCK_MUX, TYPE_DEVICE,
                                            clock_mux_init, clock_mux_class_init)

REGISTER_QEMU_OBJECT_INIT_CLASS_SIZED_NOCS(rcc_pll, RccPllState,
                                            TYPE_RCC_PLL, TYPE_DEVICE,
                                            pll_init, pll_class_init)
